### source: https://www.youtube.com/watch?v=xvpNA7bC8cs

In [190]:
import pandas as pd

#stop warnings:
import warnings; warnings.simplefilter('ignore')

In [191]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [192]:
ufo.head(3)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [193]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null object
dtypes: object(5)
memory usage: 712.6+ KB

# loc is for filtering rows and selecting columns by labels

## for this dataset however, the rows labels are integers. So we use these integers as "labels"

For rows, these labels could be the index numbers and for columns, labels would the column names

The format is dataframe.loc[,]

### selecting rows:

In [194]:
#if I want row 0 and all columns, I say this:

ufo.loc[0,:].values

array(['Ithaca', nan, 'TRIANGLE', 'NY', '6/1/1930 22:00'], dtype=object)

In [195]:
#if I want specific multiple rows and all columns:

ufo.loc[[0,1,2], :]

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

In [196]:
#there's more effecient way of doing the above:

ufo.loc[0:2, :] #select all rows from 0 through 2

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke             NaN           OVAL    CO  2/15/1931 14:00

### selecting columns:

In [197]:
#seelct all rows and the 1st column by its name
ufo.loc[:, 'City'].head(3)

0         Ithaca
1    Willingboro
2        Holyoke
Name: City, dtype: object

In [198]:
#select all rows and 2 columns by their labels
ufo.loc[:, ['City','State']].head(3)

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [199]:
#selecting city through state 
ufo.loc[:,'City':'State'].head(3)

          City Colors Reported Shape Reported State
0       Ithaca             NaN       TRIANGLE    NY
1  Willingboro             NaN          OTHER    NJ
2      Holyoke             NaN           OVAL    CO

### selecting rows and columns based on a value:

In [200]:
#without using loc:
ufo[ufo['City']=="Ithaca"]

         City Colors Reported Shape Reported State              Time
0      Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
4068   Ithaca             NaN          CIGAR    NY    6/1/1979 19:00
5631   Ithaca             NaN          OTHER    MI    6/1/1987 17:00
6961   Ithaca             NaN          OTHER    NY    1/10/1993 0:30
7573   Ithaca       RED GREEN          LIGHT    NY  10/15/1994 18:00
9088   Ithaca             NaN            NaN    NY   2/16/1996 21:45
16537  Ithaca             NaN          FLASH    MI    6/3/2000 22:35
17049  Ithaca             NaN       TEARDROP    NY   7/30/2000 20:20

In [201]:
#using loc
ufo.loc[ufo['City']=="Ithaca", :]

         City Colors Reported Shape Reported State              Time
0      Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
4068   Ithaca             NaN          CIGAR    NY    6/1/1979 19:00
5631   Ithaca             NaN          OTHER    MI    6/1/1987 17:00
6961   Ithaca             NaN          OTHER    NY    1/10/1993 0:30
7573   Ithaca       RED GREEN          LIGHT    NY  10/15/1994 18:00
9088   Ithaca             NaN            NaN    NY   2/16/1996 21:45
16537  Ithaca             NaN          FLASH    MI    6/3/2000 22:35
17049  Ithaca             NaN       TEARDROP    NY   7/30/2000 20:20

# ix is used with a mix of label and position:

In [205]:
#row 0 and column city 
ufo.ix[0, 'City']

'Ithaca'

In [206]:
#row and column of index 0
ufo.ix[0,0]

'Ithaca'

In [213]:
#give me 0 to 2 rows and columns:
ufo.ix[0:2, 0:2]

          City Colors Reported
0       Ithaca             NaN
1  Willingboro             NaN
2      Holyoke             NaN

# iloc is for selecting rows and columns based on integer index:

In [208]:
#for row and column of index 0:
ufo.iloc[0,0]

'Ithaca'

In [211]:
#for selecting the last column:
ufo.iloc[:,-1].head(3)

0     6/1/1930 22:00
1    6/30/1930 20:00
2    2/15/1931 14:00
Name: Time, dtype: object